Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/debt_collection.html.txt.tmx
Source language: en
Languages: ga

source: If you owe money to someone, they are your creditor and you are their debtor. They are entitled to ask you to pay your debts but they are not entitled to harass or intimidate you
ga: Tá do chreidiúnaí i dteideal iarraidh ort do chuid fiachas a íoc ach níl sé i dteideal tú a chiapadh nó a imeaglú

source: There are specific rules for debt collection in relation to agreements covered by the consumer credit legislation - namely the Consumer Credit Act 1995 and the European Communities (Consumer Credit Agreements) Regulations 2010. In general, financial services providers must comply with the Central Bank's Consumer Protection Code 2012
ga: Baineann rialacha ar leith le bailiú fiachais de réir comhaontuithe atá leagtha síos i reachtaíocht a bhaineann le creidmheas do thomhaltóirí - is í sin an tAcht um Chreidmheas do Thomhaltóirí 1995 agus Rialacháin na gComhphobal Eorpach (Comhaontuithe Creidmheas Tomhaltóirí) 2010 (IR 281/2010)

source: Instead of directly pursuing you for the debt, creditors sometimes sell the debt to a private collection agency
ga: In áit dul sa tóir ort, an fhéichiúnaí, go díreach chun fiachas a athshlánú, díolann creidiúnaithe an fiachas do ghníomhaireacht phríobháideach bailiúcháin uaireanta

source: Such agencies are not subject to authorisation and supervision in their own right by the Central Bank
ga: Tá roinnt de na gníomhaireachtaí príobháideacha bailiúcháin fiachais seo ag feidhmiú in Éirinn. Níl siad rialaithe

source: If it fails to do so, the Central Bank may impose penalties on the financial services provider
ga: Teagmháil idir iasachtóirí agus tomhaltóirí

source: If a regulated financial services provider plans to appoint a third party to engage with you about arrears that you owe, it must inform you of this in writing and explain the role of the third party
ga: Faoi Chód Cosanta Tomhaltóirí an Bhainc Cheannais (pdf), ní féidir le d'iasachtóir glao a chur ort nó cuairt a thabhairt ort maidir le d'iasacht gan do chead idir 9 i.n

source: They can only visit you in person if you have given your informed consent to the visit
ga: i rith na seachtaine nó tráth ar bith ar an Domhnach ná lá saoire poiblí

source: The lender is not permitted to call you or to visit you at your place of work unless you are also living there, or unless all reasonable efforts to contact you elsewhere have failed
ga: Níl cead ag iasachtóir glao a chur ort nó cuairt a thabhairt ort ag d'ionad oibre, mura bhfuil tú i do chónaí ann freisin, ach amháin sa chás go dteipeann ar gach iarracht réasúnach chun teagmháil a dhéanamh leat in áit éigin eile

source: Only the person involved in the loan can be contacted about it
ga: Ní féidir teagmháil a dhéanamh maidir le hiasacht ach amháin leis an duine lena mbaineann sé

source: This means that your lender cannot contact your employer or a member of your family about your loan
ga: Ciallaíonn sé seo nach féidir le d'iasachtóir teagmháil a dhéanamh le d'fhostóir nó le baill do theaghlaigh maidir le d'iasacht

source: If you do not engage with your creditor, they can initiate legal proceedings to recover the debt
ga: Mura bhfuil tú i dteagmháil le d'iasachtóir, tá gach cosúlacht ann go gcuirfidh d'iasachtóir tús le himeachtaí dlíthiúla chun an fiachas a athshlánú

source: All debt collectors, including private individuals and debt collection agencies, are covered by Section 11 of the Non-Fatal Offences against the Person Act 1997
ga: Tá gach bailitheoir fiachais, lena n-áirítear daoine aonair príobháideacha agus gníomhaireachtaí bailiúchán fiachais, clúdaithe ag Alt 11 den Acht um Chionta Neamh-Mharfacha in aghaidh an Duine 1997

source: This provides that a person is guilty of an offence if he/she makes any demand for payment of a debt and if:
ga: Leagann sé seo amach go bhfuil duine ciontach i gcion má dhéanann sé/sí aon éileamh ar íocaíocht fhiachais agus:

source: • The demands are so frequent as to be calculated to subject you or a member of your family to alarm, distress or humiliation, or
ga: • Má tá na héilimh chomh minic sin is a bheith mar aidhm acu tú féin nó baill do theaghlaigh a scanrú, a chrá nó a náiriú, nó

source: • The person falsely represents that criminal proceedings lie for non-payment of the debt, or
ga: • Má léiríonn an duine go bréagach gur féidir tús a chur le himeachtaí coiriúla i leith neamhíoc an fhiachais, nó

source: • The person falsely represents that he or she is authorised in some official capacity to enforce payment, or
ga: • Má léiríonn an duine go bréagach go bhfuil sé nó sí údaraithe ar chumas éigin oifigiúil íocaíocht a fhorfheidhmiú, nó

source: • The person utters a document falsely represented to have an official character
ga: • Má ritheann an duine cáipéis a léiríonn go bréagach go bhfuil carachtar oifigiúil air

source: If you are subjected to such behaviour by your creditor or by a debt collection agency, you should report the matter to the Garda Síochána. Anyone found guilty of offences under the Act is subject to large fines and up to 14 years in prison
ga: Má tá tú curtha faoi iompar den sórt sin ag do chreidiúnaí nó ag gníomhaireacht bhailiúchán fiachais, ba cheart duit an t-ábhar a chur in iúl do na Gardaí
